app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    @projects = Project.all.paginate(:page => params[:page],:per_page => 20)

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @project = Project.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @project = Project.find(params[:id])

INSERT INTO "projects" ("bugLists", "created_at", "describtion", "gitRepositories", "ircChannels", "mailLists", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(params[:project])
    respond_to do |format|
      if @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "projects" SET "describtion" = 'The Calligra project develops a set of applications for productivity and creative usage. Calligra applications run on desktops, tablets and mobile phones.
---
  def update
    @project = Project.find(params[:id])
    @temp = @project.gitRepositories
    respond_to do |format|
      if @project.update_attributes(params[:project])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 5]]
---
  def destroy
    @project = Project.find(params[:id])
    @project.destroy

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "3"]]
---
  def bug
    @project = Project.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "3"]]
---
  def git
    @project = Project.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "3"]]
---
  def mailList
    @project = Project.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "3"]]
---
  def ircChannel
    @project = Project.find(params[:id])